# intent.c
ui 树 分叉 操作;
    或者 弹出 操作(窗口,选择设置,办理);
    UI 与 文本 结合 设置_选择 项 应该设计成 格，系统
系统 主界面 APPUI 设计,成 多张 照片,一张 最后 程序结束 截图;
    或者 有 更多 程序工作 过 的 痕迹截图(轮播);
        如果 高级设计 可以 从 截图 进入 曾经 程序 上次 结束 位置open到程序 记忆位
为 节省 主界面 空间 UI设置 与 文字 一体,//向安卓就是没功能给你设置，所有都是系统控制权限，向大的win系统就是太复杂设置找不到.
    使用 要 最低层 的 子层 与 最上层 父层 形成 直达(重定向);说人话就是利用空间,
        如果 菜单栏 是 上下 没 大于 屏幕尺寸 就不需要滑动;
            如果 左右 有 空间 展开 一页 像 表格式 的 设置 选项 有 规律,有间隔,可 直接 设置;
                如果 是 子层设置 MAX长 大于屏幕 高/宽;按 弹出 设置
长按 弹出 选择 设置动作;
    或者 操作动作
        是 在 小屏幕 复杂系统 上 应用
系统 主界面 APPUI 设计，成 多张照片，一张 最后程序 结束截图;
    或者 有 更多 程序 工作过 的 痕迹截图(轮播)
主界面 添加 主菜单 负菜单 子菜单，工作 菜单栏，设置菜单，侧边菜单向VS,的 隐藏;
    或者 可见 
        或者 不可见
            UI 弹出 设置
